Repository: TiCodeX/SQLSchemaCompare
Catalog: SQLSchemaCompare.Services/Localization.*.resx
Languages: de

# LabelUsername
source: Username
de: Benutzer

# ButtonCancel
source: Cancel
de: Abbrechen

# ButtonNewProject
source: New Project
de: Neues Projekt

# ButtonOpenProject
source: Open Project
de: Projekt öffnen

# ButtonSave
source: Save
de: Speichern

# LabelLanguage
source: Language
de: Sprache

# LabelPassword
source: Password
de: Kennwort

# LabelUseSSL
source: Use SSL
de: SSL verwenden

# LabelUseWindowsAuthentication
source: Use Windows Authentication
de: Windows-Authentifizierung verwenden

# TitleWelcome
source: Welcome to {0}
de: Willkommen bei {0}

# LabelOptions
source: Options
de: Optionen

# LabelTable
source: Table
de: Tabelle

# MenuCloseProject
source: Close Project
de: Projekt schließen

# MenuExit
source: Exit
de: Beenden

# MenuFile
source: File
de: Datei

# MenuNewProject
source: New Project
de: Neues Projekt

# MenuOpenProject
source: Open Project
de: Projekt öffnen

# MenuProject
source: Project
de: Projekt

# MenuSaveProject
source: Save Project
de: Projekt speichern

# MenuSettings
source: Settings
de: Einstellungen

# ErrorAccountLocked
source: Account is locked
de: Ihr Konto ist gesperrt

# TitleLoginError
source: Login error
de: Login-Fehler

# NotificationNewVersionAvailable
source: New version available!
de: Neue Version verfügbar!

# ButtonClose
source: Close
de: Schliessen

# ButtonQuit
source: Quit
de: Beenden

# NotificationUpdateReadyToBeInstalled
source: The new version v{0} is available and ready to be installed.
de: Die neue version v{0} ist verfügbar und kann installiert werden.

# NotificationNewVersionAvailableMessage
source: The new version v{0} has been released, please visit the TiCodeX website to download it.
de: Die neue Version v{0} wurde veröffentlicht. Bitte besuchen Sie die TiCodeX-Website, um sie herunterzuladen.

# ButtonUpdateAndRestart
source: Update and restart
de: Aktualisieren und neu starten

# MenuSignOut
source: Sign out
de: Abmelden

# LabelSavePassword
source: Save password
de: Kennwort speichern

# LabelNewProject
source: New Project...
de: Neues Projekt

# LabelNewPostgreSQLProject
source: New PostgreSQL Project
de: Neues PostgreSQL Projekt

# LabelNewMySqlProject
source: New MySql Project
de: Neues MySql Projekt

# LabelNewMicrosoftSQLServerProject
source: New Microsoft SQL Server Project
de: Neues Microsoft SQL Server Projekt

# LabelCreateNewProjects
source: Create New Project
de: Neues Projekt erstellen

# StatusError
source: Error
de: Fehler

# ButtonNo
source: No
de: Nein

# ButtonYes
source: Yes
de: Ja

# TitleError
source: Error
de: Fehler

# TitleSaveProject
source: Save Project
de: Projekt speichern

# TitleOpenProject
source: Open Project
de: Projekt öffnen

# ButtonOpen
source: Open
de: Öffnen

# LabelSQLSchemaCompareProjectFile
source: SQL Schema Compare Project
de: SQL Schema Compare Projekt

# MenuHelp
source: Help
de: Hilfe

# MenuAbout
source: About...
de: Über...

# LabelFunction
source: Function
de: Funktion

# LabelIdentical
source: Identical
de: Gleich

# LabelDatabase
source: Database
de: Datenbank

# LabelInBothButDifferent
source: In both, but different
de: In beiden, aber unterschiedlich

# LabelOpen
source: Open...
de: Öffnen...

# ButtonAbort
source: Abort
de: Abbrechen

# ButtonCompareNow
source: Compare Now
de: Jetzt vergleichen

# LabelRecentProjects
source: Recent Projects
de: Zuletzt verwendete Projekte

# LabelType
source: Type
de: Typ

# LabelDataSources
source: Data sources
de: Datenquelle

# LabelOnlyInSource
source: Only in Source
de: Nur in der Quelle vorhanden

# LabelOnlyInTarget
source: Only in Target
de: Nur im Ziel vorhanden

# LabelSource
source: Source
de: Quelle

# LabelTarget
source: Target
de: Ziel

# LabelView
source: View
de: Sicht

# MenuEditProject
source: Edit Project
de: Ändern

# MenuSaveProjectAs
source: Save Project As
de: Projekt speichern unter

# LabelIgnoreCollate
source: Ignore Collation
de: Datenbanksortierung ignorieren

# LabelOrderColumnAlphabetically
source: Order columns alphabetically
de: Zeilen alphabetisch sortieren

# LabelStoredProcedure
source: Stored Procedure
de: Gespeicherte Prozedur

# MenuCompare
source: Compare
de: Vergleichen

# LabelIgnoreReferenceTableColumnOrder
source: Ignore source table column order
de: Reihenfolge der Spalten ignorieren

# ErrorGeneric
source: An error occurred
de: Es ist ein Fehler aufgetreten

# ErrorInvalidUsernameOrPassword
source: Invalid username or password
de: Nutzername oder Kennwort ungültig

# LabelSequence
source: Sequence
de: Reihenfolge

# LabelLogLevel
source: Logging level
de: Loglevel

# ErrorEmailNotSpecified
source: E-mail not specified
de: Email wurde nicht angegeben

# ErrorEmailNotVerified
source: E-mail not verified
de: Email wurde noch nicht verifiziert

# ErrorLoginVerificationFailed
source: Failed to verify login
de: Verifizierung fehlgeschlagen

# ErrorNoSubscriptionAvailable
source: No subscription plan has been found
de: Kein aktives Abonnement gefunden.

# ErrorPasswordNotSpecified
source: Password not specified
de: Kennwort wurde nicht angegeben

# ErrorProductIsMissing
source: Product is missing
de: Produkt fehlt

# ErrorSessionExpired
source: The session has expired
de: Ihre Sitzung ist abgelaufen

# ErrorSubscriptionExpired
source: The current subscription has expired
de: Das aktuelle Abonnement ist verfallen

# ErrorTrialSubscriptionExpired
source: The current trial subscription has expired
de: Die Probezeit ist abgelaufen

# ErrorCannotContactTiCodeXWebsite
source: Unable to contact TiCodeX website:
de: Verbindung mit den TiCodeX Servern nicht möglich:

# ButtonPrev
source: Prev
de: Zurück

# ButtonNext
source: Next
de: Weiter

# ErrorLoadProject
source: Cannot load the file: {0}
de: Datei kann nicht geöffnet werden: {0}

# ErrorApplicationUpdateNeeded
source: A newer version of {0} is available. Please update it.
de: Es ist eine neue Version von {0} verfügbar. Bitte aktualisieren.

# ErrorCannotCloseProject
source: Unable to close the project
de: Projekt kann nicht geschlossen werden.

# ErrorCannotCreateNewProject
source: Unable to create a new project
de: Es kann kein neues Projekt erstellt werden.

# ErrorCannotSaveProject
source: Unable to save the project: {0}
de: Projekt kann nicht gespeichert werden: {0}

# ErrorEmptyDatabases
source: No objects found, both databases are empty
de: Keine Objekte gefunden. Beide Datenbanken sind leer.

# ErrorLoadProjectFileNotFound
source: Cannot load project file: file not found.
de: Projekt kann nicht geladen werden. Datei nicht gefunden.

# ErrorLoadProjectInvalidProjectFile
source: Unable to read {0} project file: invalid file format.
de: Das Projekt {0} kann nicht geladen werden. Format ungültig.

# ErrorLoadProjectIOError
source: Cannot load the project file because an error has occurred while reading the file: {0}
de: Projekt kann nicht geladen werden, da ein Fehler aufgetreten ist {0}

# ErrorLoadProjectUnauthorizedFileAccess
source: Cannot load the project file: access is denied.
de: Projekt kann nicht geladen werden, Zugriff verweigert.

# ErrorOperationCanceled
source: The operation was canceled
de: Der Vorgang wurde abgebrochen.

# ErrorOperationNotExecuted
source: The operation was not executed
de: Der Vorgang wurde nicht ausgeführt.

# ErrorUnableToReadAppSettings
source: Unable to load {0} settings from {1}
de: Die Einstellungen {0} konnten nicht von {1} geladen werden.

# LabelDatabaseComparison
source: Comparison of Databases
de: Datenbankvergleich

# LabelDoesNotExist
source: Does not exist
de: Nicht vorhanden

# LabelForeignKeys
source: Foreign Keys
de: Fremdschlüssel

# LabelFunctions
source: Functions
de: Funktionen

# LabelIndexes
source: Indexes
de: Indizes

# LabelMappingDatabaseObjects
source: Mapping Database Objects
de: Zuordnung der Datenbankobjekte

# LabelMigrationScript
source: Migration Script
de: Migrationsskript

# LabelRetrieveSourceDatabase
source: Retrieve the Source Database
de: Lese Quelldatenbank

# LabelRetrieveTargetDatabase
source: Retrieve the Target Database
de: Lese Zieldatenbank

# LabelStoredProcedures
source: Stored Procedures
de: Gespeicherte Prozeduren

# LabelTables
source: Tables
de: Tabellen

# LabelUserDefinedType
source: User-Defined Data Type
de: Benutzerdefinerter Datentyp

# LabelUserDefinedTypes
source: User-Defined Data Types
de: Benutzerdefinierte Datentypen

# LabelViews
source: Views
de: Sichten

# MenuFullSourceDatabaseScript
source: Full Source Database Script
de: Vollständiges Quelldatenbank-Skript

# MenuFullTargetDatabaseScript
source: Full Target Database Script
de: Vollständiges Zieldatenbank-Skript

# MenuGenerateScript
source: Generate Script
de: Skript erstellen

# MenuManageProfile
source: Manage profile
de: Profil verwalten

# MenuOpenLogsFolder
source: Open Logs Folder
de: Logverzeichnis öffnen

# MessageConfirmAbortOperation
source: Are you sure you want to abort the operation?
de: Soll der Vorgang wirklich abgebrochen werden?

# MessageDownloadLatestVersion
source: Download latest version
de: Neueste Version herunterladen

# MessageDoYouWantToSaveProjectChanges
source: Do you want to save the changes to the opened project?
de: Sollen die Änderungen vom geöffneten Projekt gespeichert werden?

# MessageGetASubscription
source: Get a subscription
de: Abonnement kaufen

# MessageProjectSavedSuccessfully
source: The project has been saved.
de: Das Projekt wurde gespeichert.

# StatusComparingDataTypes
source: Comparing User-Defined Data Types...
de: Vergleiche Benutzerdefinierte Datentypen...

# StatusComparingFunctions
source: Comparing Functions...
de: Vergleiche Funktionen...

# StatusComparingStoredProcedures
source: Comparing Stored Procedures...
de: Vergleiche gespeicherte Prozeduren...

# StatusComparingTables
source: Comparing Tables...
de: Vergleiche Tabellen...

# StatusComparingViews
source: Comparing Views...
de: Vergleiche Sichten...

# StatusConnecting
source: Connecting to server...
de: Veribinde zum Server...

# StatusDone
source: Done
de: Beendet

# StatusMappingDataTypes
source: Mapping User-Defined Data Types...
de: Benutzerdefinierte Datentypen zuordnen...

# StatusMappingFunctions
source: Mapping Functions...
de: Funktionen zuordnen...

# StatusMappingStoredProcedures
source: Mapping Stored Procedures...
de: Gespeicherte Prozeduren zuordnen...

# StatusMappingTables
source: Mapping Tables...
de: Tabellen zuordnen...

# StatusMappingViews
source: Mapping Views...
de: Sichten zuordnen.

# StatusRetrievingDataTypes
source: Retrieving User-Defined Data Types...
de: Lese Benutzerdefinierte Datentypen...

# StatusRetrievingForeignKeys
source: Retrieving Foreign Keys...
de: Lese Fremdschlüssel...

# StatusRetrievingFunctions
source: Retrieving Functions...
de: Lese Funktionen...

# StatusRetrievingIndexes
source: Retrieving Indexes...
de: Lese Indizes...

# StatusRetrievingStoredProcedures
source: Retrieving Stored Procedures...
de: Lese gespeicherte Prozeduren...

# StatusRetrievingTables
source: Retrieving Tables...
de: Lese Tabellen...

# StatusRetrievingViews
source: Retrieving Views...
de: Lese Sichten...

# TitleAbortCompare
source: Abort Compare
de: Vergleichen abbrechen

# StatusRetrievingConstraints
source: Retrieving Constraints...
de: Lese Einschränkungen...

# StatusRetrievingTriggers
source: Retrieving Triggers...
de: Lese Trigger...

# StatusRetrievingSequences
source: Retrieving Sequences...
de: Lese Sequenzen...

# StatusMappingSequences
source: Mapping Sequences...
de: Sequenzen zuordnen...

# StatusComparingSequences
source: Comparing Sequences...
de: Vergleiche Sequenzen...

# LabelTriggers
source: Triggers
de: Trigger

# LabelSQLView
source: SQL View
de: SQL Ansicht

# LabelSequences
source: Sequences
de: Sequenzen

# LabelOrderColumnAlphabeticallyDescription
source: Reorder the columns alphabetically to ignore differences of tables created with a different order.
de: Spalten alphabethisch anordnen um die Unterschiede der Tabellen von einer anderen Sortierung zu ignorieren.

# LabelIgnoreCollateDescription
source: Ignore Collations on character data type columns when comparing databases.
de: Datenbanksortierung beim Vergleichen von Text-Spalten ignorieren.

# LabelIgnoreReferenceTableColumnOrderDescription
source: During the comparison the column order of the target table is reordered referencing the order in the source. This option will ignore the matching and use the same order as when it was created.
de: Während dem Vergleich werden die Spalten der Zieltabelle entsprechend der Quelle angeordnet. Diese Option ignoriert die Zuweisung und verwendet die selbe Reienfolge in welcher Sie erstellt wurden.

# LabelConstraints
source: Constraints
de: Einschränkungen

# LabelPrimaryKeys
source: Primary Keys
de: Primärschlüssel

# LabelReferencingForeignKeys
source: Foreign Keys referencing this table
de: Fremdschlüssel referenzieren diese Tabelle

# MenuFullMigrationScript
source: Full Migration Script
de: Vollständiges Migrationsskript

# LabelCopySettingsRight
source: Copy connection settings right
de: Verbindungseinstellungen rechts kopieren

# LabelCopySettingsLeft
source: Copy connection settings left
de: Verbindungseinstellungen links kopieren

# LabelCopySettingsExchange
source: Switch left and right connection settings
de: Verbindungseinstellungen tauschen
